{"cells":[{"attachments":{},"cell_type":"markdown","metadata":{"id":"cbpnfORNza8p"},"source":["1. Написать программу, которая будет выводить на экран числа Фибоначчи до заданного числа."]},{"cell_type":"code","execution_count":1,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":4748,"status":"ok","timestamp":1686317395038,"user":{"displayName":"Kirill Boogaga","userId":"09812157734530722712"},"user_tz":-180},"id":"iGRvNNhJzgI-","outputId":"f77d38d1-309c-4437-cc41-64843ffe0b9c"},"outputs":[{"name":"stdout","output_type":"stream","text":["0\n","1\n","1\n","2\n","3\n","5\n","8\n","13\n","21\n"]}],"source":["n = int(input(\"Введите число, до которого нужно вывести последовательность Фибоначчи: \"))\n","\n","# Инициализация первых двух чисел Фибоначчи\n","a, b = 0, 1\n","\n","# Вывод первых n чисел Фибоначчи, не превышая n\n","if n >= 0:\n","    print(a)\n","    if n >= 1:\n","        print(b)\n","    c = a + b\n","    while c <= n:\n","        print(c)\n","        a, b = b, c\n","        c = a + b"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"T5Kb3jPB1Jd6"},"source":["2. Напишите программу, которая на вход принимает список чисел и возвращает только уникальные значения из этого списка."]},{"cell_type":"code","execution_count":2,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":6,"status":"ok","timestamp":1686317398949,"user":{"displayName":"Kirill Boogaga","userId":"09812157734530722712"},"user_tz":-180},"id":"TMXEB-5f1mzh","outputId":"a655615b-3278-4799-d1d1-098d9c21a55a"},"outputs":[{"name":"stdout","output_type":"stream","text":["[1, 2, 3, 4, 5, 'hello', 'bye']\n","[4, 5, 'bye']\n"]}],"source":["# Вариант 1 (список без повторов)\n","my_list = [1, 2, 3, 2, 4, 1, 5, 3, 'hello', 'hello', 'bye']\n","unique_list = list(set(my_list))\n","print(unique_list)\n","\n","# Вариант 2 (список с элементами у которых нет повторов)\n","my_list = [1, 2, 3, 2, 4, 1, 5, 3, 'hello', 'hello', 'bye']\n","unique_list = []\n","for element in my_list:\n","  if element not in unique_list:\n","    unique_list.append(element)\n","  else:\n","    unique_list.remove(element)\n","print(unique_list)"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"qDQzEYEd4tmw"},"source":["3. Напишите программу, которая переводит температуру в градусах Фаренгейта в градусы Цельсия."]},{"cell_type":"code","execution_count":3,"metadata":{"id":"qJzoas3740PC"},"outputs":[{"name":"stdout","output_type":"stream","text":["10.0 градусов Фаренгейта соответствуют -12.22 градусам Цельсия\n"]}],"source":["def fahrenheit_to_celsius(fahrenheit):\n","    celsius = (fahrenheit - 32) * 5/9\n","    return round(celsius, 2)\n","\n","while True:\n","    try:\n","        temperature_fahrenheit = float(input(\"Введите температуру в градусах Фаренгейта: \"))\n","        temperature_celsius = fahrenheit_to_celsius(temperature_fahrenheit)\n","        print(f\"{temperature_fahrenheit} градусов Фаренгейта соответствуют {temperature_celsius} градусам Цельсия\")\n","        break\n","    except ValueError:\n","        print(\"Ошибка: введите число\")\n"]},{"attachments":{},"cell_type":"markdown","metadata":{"id":"yYNUcoYY9pc-"},"source":["4. Напишите программу, которая проверяет, является ли строка палиндромом без использования стандартных методов."]},{"cell_type":"code","execution_count":4,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":249,"status":"ok","timestamp":1686248406010,"user":{"displayName":"Виталий Проценко","userId":"05595894691527682266"},"user_tz":-180},"id":"7_TkqWfu9viX","outputId":"70471713-771b-4aae-9610-d3b6fbb4b934"},"outputs":[{"name":"stdout","output_type":"stream","text":["а роза упала на лапу Азора - это палиндром\n"]}],"source":["# Вариант без использования методов python (P.S. использовались только функции)\n","def is_palindrome(s:str)->bool:\n","    chars_to_remove = [' ', ',', '.', '!', '?', ';', ':', 'ь', 'ъ', \"'\", '\"', '-']\n","    new_s = ''\n","    for char in s:\n","        if char not in chars_to_remove:\n","          if 'А' <= char <= 'Я' or 'A' <= char <= 'Z':\n","            new_s += chr(ord(char) + 32)\n","          else:\n","            new_s += char\n","    reversed_s = new_s[::-1]\n","    return new_s == reversed_s \n","        \n","s = \"а роза упала на лапу Азора\"\n","#s = \"Was it a cat I saw?\"\n","if is_palindrome(s):\n","    print(f\"{s} - это палиндром\")\n","else:\n","    print(f\"{s} - это не палиндром\")"]}],"metadata":{"colab":{"provenance":[{"file_id":"1HBYkaVpqgLjwNL0Bb-DDc1sRUOq7obcJ","timestamp":1686173991176}]},"kernelspec":{"display_name":"Python 3","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.9.16"}},"nbformat":4,"nbformat_minor":0}
